---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.WeatherFile
source: html/e1ae6850-4df0-d36d-3dfc-7f40acd06706.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.WeatherFile Property

The full path name of the weather file used for the systems analysis.

## Syntax (C#)
```csharp
public string WeatherFile { get; }
```